import Navbar from "@/components/landing-page/Navbar";

export default function PrivacyPage() {
	return (
		<div className="min-h-screen bg-white">
			<Navbar />
			<main className="pt-32 pb-20 px-4 max-w-4xl mx-auto">
				<h1 className="text-4xl font-bold mb-8 text-[#012d46]">
					سياسة الخصوصية
				</h1>
				<div className="space-y-6 text-gray-600 leading-relaxed">
					<p>
						نقدر مخاوفكم واهتمامكم بشأن خصوصية بياناتكم على شبكة
						الإنترنت. لقد تم إعداد هذه السياسة لمساعدتكم في تفهم
						طبيعة البيانات التي نقوم بتجميعها منكم عند زيارتكم لموقعنا
						الإلكتروني وكيفية تعاملنا مع هذه البيانات الشخصية.
					</p>

					<h2 className="text-2xl font-semibold text-[#012d46]">
						التصفح
					</h2>
					<p>
						لم نقم بتصميم هذا الموقع من أجل تجميع بياناتك الشخصية من
						جهاز الكمبيوتر الخاص بك أثناء تصفحك لهذا الموقع، وإنما
						سيتم فقط استخدام البيانات المقدمة من قبلك بمعرفتك ومحض
						إرادتك.
					</p>

					<h2 className="text-2xl font-semibold text-[#012d46]">
						إفشاء المعلومات
					</h2>
					<p>
						سنحافظ في كافة الأوقات على خصوصية وسرية كافة البيانات
						الشخصية التي نتحصل عليها. ولن يتم إفشاء هذه المعلومات
						إلا إذا كان ذلك مطلوباً بموجب أي قانون أو عندما نعتقد
						بحسن نية أن مثل هذا الإجراء سيكون مطلوباً أو مرغوباً فيه
						للتمشي مع القانون، أو للدفاع عن أو حماية حقوق الملكية
						الخاصة بهذا الموقع أو الجهات المستفيدة منه.
					</p>

                    <h2 className="text-2xl font-semibold text-[#012d46]">
                        البيانات اللازمة لتنفيذ المعاملات المطلوبة من قبلك
                    </h2>
                    <p>
                        عندما نحتاج إلى أية بيانات خاصة بك، فإننا سنطلب منك تقديمها بمحض إرادتك. حيث ستساعدنا هذه المعلومات في الاتصال بك وتنفيذ طلباتك حيثما كان ذلك ممكنناً. لن يتم اطلاقاً بيع البيانات المقدمة من قبلك إلى أي طرف ثالث بغرض تسويقها لمصلحته الخاصة دون الحصول على موافقتك المسبقة والمكتوبة ما لم يتم ذلك على أساس أنها ضمن بيانات جماعية تستخدم للأغراض الإحصائية والأبحاث دون اشتمالها على أية بيانات من الممكن استخدامها للتعريف بك.
                    </p>

					<h2 className="text-2xl font-semibold text-[#012d46]">
						اتصل بنا
					</h2>
					<p>
						يمكنكم الاتصال بنا عند الحاجة من خلال الضغط على رابط
						اتصل بنا المتوفر في روابط موقعنا أو الارسال الى بريدنا
						الالكتروني info@bilfora.com.
					</p>
				</div>
			</main>
		</div>
	);
}

